{"locale":"es","localeDirection":"ltr","cardDetailsLabel":"Detalles de la tarjeta","cardNumberLabel":"Número de tarjeta","inValidCardErrorText":"El número de la tarjeta no es válido.","inCompleteCVCErrorText":"El código de seguridad de su tarjeta está incompleto.","inValidCVCErrorText":"El código de seguridad de su tarjeta no es válido.","inCompleteExpiryErrorText":"La fecha de vencimiento de su tarjeta está incompleta.","inValidExpiryErrorText":"La fecha de caducidad de su tarjeta no es válida.","pastExpiryErrorText":"El año de vencimiento de su tarjeta ya ha pasado.","poweredBy":"Desarrollado por Hyperswitch","validThruText":"Vencimiento","sortCodeText":"Código Sort","cvcTextLabel":"CVV","line1Label":"Línea de dirección 1","line1Placeholder":"Dirección postal","line1EmptyText":"La línea de dirección 1 no puede estar vacía","line2Label":"Línea de dirección 2","line2Placeholder":"Piso, número de departamento, etc. (opcional)","cityLabel":"Ciudad","cityEmptyText":"La ciudad no puede estar vacía.","postalCodeLabel":"Código postal","postalCodeEmptyText":"El código postal no puede estar vacío.","stateLabel":"Provincia/estado","accountNumberText":"Número de cuenta","emailLabel":"Correo electrónico","emailInvalidText":"Dirección de correo electrónico no válida","emailEmptyText":"El correo electrónico no puede estar vacío","fullNameLabel":"Nombre completo","fullNamePlaceholder":"Nombre y apellidos","countryLabel":"País","currencyLabel":"Moneda","bankLabel":"Seleccionar banco","redirectText":"Después de enviar su pedido, se le redirigirá para que complete su compra de forma segura.","bankDetailsText":"Después de enviar estos datos, obtendrá la información de la cuenta bancaria para realizar el pago. Asegúrese de anotarla.","orPayUsing":"O pague con","addNewCard":"Añadir tarjeta de crédito/débito","useExisitingSavedCards":"Utilizar las tarjetas de débito/crédito guardadas","saveCardDetails":"Guardar la información de la tarjeta","addBankAccount":"Añadir cuenta bancaria","achBankDebitTermsPart1":"Al proporcionar su número de cuenta y confirmar este pago, autoriza a ","achBankDebitTermsPart2":" y Hyperswitch, nuestro proveedor de servicios de pago, a enviar órdenes a su banco para que aplique cargos en su cuenta y para que realice los correspondientes adeudos en la misma de acuerdo con dichas órdenes. Tiene derecho a recibir un reembolso de su banco de acuerdo con las condiciones del contrato suscrito. El reembolso debe reclamarse en un plazo de 8 semanas desde la fecha en la que se aplicó el cargo en su cuenta.","sepaDebitTermsPart1":"Al proporcionar su información de pago y confirmar este pago, autoriza a (A) ","sepaDebitTermsPart2":" y Hyperswitch, nuestro proveedor de servicios de pago o a PPRO, su proveedor de servicios local, a enviar órdenes a su banco para que aplique cargos en su cuenta y (B) para que realice los correspondientes adeudos en la misma de acuerdo con dichas órdenes. Como parte de sus derechos, tiene la potestad de que su banco le devuelva el dinero según las condiciones de su contrato. El reembolso debe reclamarse en un plazo de 8 semanas desde la fecha en la que se aplicó el cargo en su cuenta. Sus derechos aparecen explicados en una declaración que puede solicitar en su banco. Acepta recibir notificaciones de futuros cargos hasta 2 días antes de que se produzcan.","becsDebitTerms":"Al proporcionar los datos de su cuenta bancaria y confirmar este pago, acepta esta solicitud de domiciliación bancaria y el acuerdo de servicio para la misma. Además, autoriza a Hyperswitch Payments Australia Pty Ltd ACN 160 180 343, número de identificación de usuario de domiciliación bancaria 507156 («Hyperswitch»), a realizar adeudos en su cuenta a través del sistema de compensación electrónica masiva (BECS) en nombre de Hyperswitch Payment Widget (el «comercio») por cualquier importe que el comercio le comunique individualmente. Certifica que es titular de una cuenta o un firmante autorizado en la cuenta indicada anteriormente.","cardTermsPart1":"Al proporcionar la información de su tarjeta, permite a ","cardTermsPart2":" que realice cargos en su tarjeta para futuros pagos de acuerdo con sus términos.","payNowButton":"Pagar ahora","cardNumberEmptyText":"El número de la tarjeta no puede estar vacío","cardExpiryDateEmptyText":"La fecha de vencimiento de la tarjeta no puede estar vacía","cvcNumberEmptyText":"El número CVV no puede estar vacío","enterFieldsText":"Rellene todos los campos","enterValidDetailsText":"Introduzca datos válidos","card":"Tarjeta","billingNameLabel":"Nombre de facturación","cardHolderName":"Nombre del titular de la tarjeta","cardNickname":"Apodo de la tarjeta","billingNamePlaceholder":"Nombre y apellido","firstName":"Nombre de pila","lastName":"Apellido","billingDetails":"Detalles de facturación","requiredText":"Requerido","lastNameRequiredText":"Apellido Necesario","cardExpiresText":"expira","invalidDigitsCardHolderNameError":"El nombre del titular de la tarjeta no puede tener dígitos","nickNameLengthExceedError":"El apodo no puede superar los 12 caracteres","invalidDigitsNickNameError":"El apodo no puede tener más de 2 dígitos","addPaymentMethodLabel":"Agregar nuevo método de pago","cardHolderNameRequiredText":"Se requiere el nombre del titular de la tarjeta","walletDisclaimer":"Los detalles de la billetera se guardarán al realizar la selección."}